app/controllers/users_controller.rb

    def index
        @users = User.all()
---
SELECT "users".* FROM "users"

    def create_notification
        begin
        @user = User.find_by(id: params["user_id"])
        notification = Notification.create!(content: params["content"], status: params["status"], user_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notifications" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello"], ["user_id", 1], ["created_at", "2021-11-19 09:19:47.662877"], ["updated_at", "2021-11-19 09:19:47.662877"]]

    def get_user_notification
        begin
        @user = User.find_by(id: params["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]